using System;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using AG.Core.Helpers;
using AG.Core.Models;
using AG.Core.Task;
using System.Globalization;

namespace AG
{
    class Program
    {
        static void Main(string[] args)
        {
            //обновить договора
            //var opt = new ParallelOptions() { MaxDegreeOfParallelism = 8 };
            //var clients = AggregatorHelper.Client.List(true)
            //    .Where(p => p.Contract != null && !string.IsNullOrEmpty(p.Contract.Number) && p.Contract.Date < new DateTime(2017, 4, 1))
            //    .OrderBy(p => p.Number);
            //Parallel.ForEach(clients, opt, client =>
            //{
            //    try
            //    {
            //        var remotePath = YandexDiskHelper.Folders.Combine(StaticHelper.ClientsFolder, client.Contract.Number);
            //        var files = YandexDiskHelper.Folders.Resources(remotePath);
            //        if (files != null && files._embedded != null && files._embedded.items != null)
            //        {
            //            Console.WriteLine(client.Contract.Number);

            //            var contract = files._embedded.items.Where(p => p.name.StartsWith("contract_"));
            //            if (contract.Any(p => p.name.Contains("_arhiv")))
            //                return;

            //            foreach (var item in contract)
            //            {
            //                YandexDiskHelper.Files.Rename(item.path, item.path.Replace(".pdf", "_arhiv.pdf"));
            //            }

            //            СгенерироватьДоговор.Run(client.Agg, client.Db, Environment.CurrentDirectory);
            //        }
            //    }
            //    catch (Exception e)
            //    {
            //        Console.WriteLine(e.Message);
            //    }
            //});


            //var client = AggregatorHelper.Client.List().Where(p => new[] { 14 }.Contains(p.Number));
            //foreach (var item in client)
            //{
            //    var pay = AggregatorHelper.Pays.List(item.Agg, item.Db, new DateTime(2017, 1, 1, 0, 0, 0, DateTimeKind.Utc).AddHours(-3), new DateTime(2017, 2, 1, 0, 0, 0, DateTimeKind.Utc).AddHours(-3), true);
            //    using (var write = new StreamWriter(string.Format(@"E:\r_{0}_{1}.csv", item.City, item.Number), false, System.Text.Encoding.GetEncoding(1251)) { AutoFlush = true })
            //    using (var csvWrite = new CsvWriter(write))
            //    {
            //        csvWrite.Configuration.HasHeaderRecord = true;
            //        csvWrite.Configuration.Delimiter = ";";
            //        csvWrite.Configuration.RegisterClassMap<AggregatorPayWriterMap>();
            //        //csvWrite.WriteRecords(pay);

            //        var tanker = pay.Where(p => (p.description ?? "").Contains("TANKER:")).ToArray();
            //        if (tanker != null)
            //        {

            //        }

            //        var items = pay.GroupBy(p => new { p.pay_type, p.group }).Select(p => new AggregatorPay() { sum = p.Sum(e => e.sum_with_factor), description = p.Key.pay_type, group = p.Key.group }).ToList();
            //        items.Add(new AggregatorPay()
            //        {
            //            description = "Начало",
            //            sum = pay.OrderBy(p => p.date).First().balance - pay.OrderBy(p => p.date).First().sum_with_factor
            //        });
            //        items.Add(new AggregatorPay()
            //        {
            //            description = "Конец",
            //            sum = pay.OrderBy(p => p.date).Last().balance
            //        });
            //        csvWrite.WriteRecords(items);
            //    }
            //}

            //ОтчетПереключении.Run();
            //ОтчетОстатки2015.Run();
            //ОборотноСальдоваяВедомость.RunYear(Environment.CurrentDirectory);
            ОборотноСальдоваяВедомость.Run(Environment.CurrentDirectory);

            //for (var i = new DateTime(2018, 8, 1); i <= new DateTime(2018, 8, 1); i = i.AddMonths(1))
            //{
            //    СформироватьСправки.Run(i, Environment.CurrentDirectory);
            //}

            //СверкаБанка.Run();

            //НалоговаяВыгрузка.Run();
            //НалоговаяВыгрузка.RunFileReports();
            //НалоговаяВыгрузка.RunFileInvoices();

            //ПроверитьНомераДоговоров.Run();
            //ЗагрузитьСтарыеДокументы.Run();


            //var date = new DateTime(2018, 7, 1);
            //СгенерироватьОтчетАгент.Run(Environment.CurrentDirectory, date, "d9ea4d474cbc48929c5bb779da3352ad");
            //var date = new DateTime(2017, 12, 1);
            //СгенерироватьОтчетАгент.Run(Environment.CurrentDirectory, date, "bb53804f47c44d978c1e460e5cec63a8");
            //СгенерироватьОтчетВыводы.Run(Environment.CurrentDirectory, date);
            //РассылкаОтчетаАгента.Run(date);


            //СчетаФактуры.Run();
            //СгенерироватьДоговор.Run(Environment.CurrentDirectory);
            //СгенерироватьДоговор.Run("f5ff482cbc764672b93063d64f486a27", "68f1213c5825487b973f1e1279bf8421", Environment.CurrentDirectory, true);
            //ЗагрузитьПлатежиКиви.Run();
            //ЗагрузитьОтчетПоКомиссии.Run(Environment.CurrentDirectory);
            //CSVСтатистика.Run();

            //СгенерироватьДоговор.Run("d1bf2d6baf30419f8addad3bb0ed1d7b", "f1e7bf84a5db4ab1bb888a95e96826eb", Environment.CurrentDirectory, true); //msk
            //СгенерироватьДоговор.Run("971452918f1a497ba6c9fb71af2d0f21", "85d064616f62484c85aac4afc6769229", Environment.CurrentDirectory, true); //spb
            //СгенерироватьДоговор.Run("971452918f1a497ba6c9fb71af2d0f21", "cff3acd3d66e4f72b87f860fa4747525", Environment.CurrentDirectory, true);
            //СгенерироватьРасторжение.Run("971452918f1a497ba6c9fb71af2d0f21", "85d064616f62484c85aac4afc6769229", Environment.CurrentDirectory, true);
            //ПроверитьРеквизиты.Run();
            //СверкаБанка.Run();


            //AggregatorHelper.Bill.Update(new DateTime(2018, 8, 1));
            //СгенерироватьСчетаФактуры.Run(new DateTime(2018, 8, 1));

//            СчетаЯндекс.Run(new DateTime(2018, 8, 1), @"
//Уфа	20180831000359	 269 616,34   
//Омск	20180831000335	 380 298,72   
//Челябинск	20180831000394	 619 606,73   
//Самара	20180831000344	 491 276,33   
//Москва	20180831003308	 16 269 875,86   
//Нижний Новгород	20180831000326	 246 236,66   
//Ростов-на-Дону	20180831000295	 1 092 528,62   
//Сочи	20180831000157	 230 592,10   
//Пермь	20180831020447	 1 507 640,86   
//Екатеринбург	20180831000300	 2 167 318,18   
//Казань	20180831000211	 1 509 722,07   
//Санкт-Петербург	20180831000178	 902 859,62   
//Волгоград	20180831000322	 32 548,76   
//Новосибирск	20180831000810	 1 001 719,66   
//Тюмень	20180831000414	 1 042 642,23   
//Краснодар	20180831000303	 2 297 797,93   
//Саратов	20180831001806	 425 394,90   
//Ижевск	20180831000971	 183 343,28   
//Новокузнецк	20180831001113	 26 667,84   
//Киров	20180831000946	 31 103,68   
//Красноярск	20180831001414	 90 229,18  
//Воронеж	20180831000338	 105 252,16   
//Ярославль	20180831000942	 19 824,03 
//Ставрополь	20180831002084	 285 154,19   
//Набережные Челны	20180831001377	 218 178,94   
//Курск	20180831003508	 9 739,11   
//Калининград	20180831020181	 253 360,40   
//Рязань	20180831001302	 39 724,73
//Оренбург	20180831000330	 8 895,32   
//Кемерово	20180831000967	 83 577,89   
//Чебоксары	20180831000980	 305 473,17   
//Хабаровск	20180831000314	 72 122,36   
//Владивосток	20180831000319	 332 585,31  
//Пенза	20180831001106	 20 015,57");

//            СчетаЯндекс.Run(new DateTime(2018, 7, 1), @"
//Уфа	20180731003044	 299 870,04   
//Омск	20180731003012	395 251,52
//Челябинск	20180731003058	 743 723,31   
//Самара	20180731003023	 566 305,59   
//Москва	20180731006123	 17 324 089,27   
//Нижний Новгород	20180731003013	 248 242,86 
//Ростов-на-Дону	20180731002965	 1 137 020,06  
//Сочи	20180731002809	 219 087,49   
//Пермь	20180731002841	 1 530 570,37   
//Екатеринбург	20180731002949	 2 305 388,30   
//Казань	20180731002835	 1 573 815,87  
//Санкт-Петербург	20180731002825	 1 231 459,80   
//Волгоград	20180731003003	 46 242,09 
//Новосибирск	20180731003548	 878 699,24   
//Тюмень	20180731003082	 1 420 219,42   
//Краснодар	20180731002970	 2 460 142,86   
//Саратов	20180731003718	 594 055,61 
//Ижевск	20180731003711	 218 395,13   
//Новокузнецк	20180731003873	 30 104,28   
//Киров	20180731003682	 35 645,65 
//Красноярск	20180731003703	 99 241,72
//Воронеж	20180731003011	 128 942,93 
//Ярославль	20180731003675	 15 610,88
//Ставрополь	20180731004915	 218 279,58 
//Набережные Челны	20180731004170	 233 799,49 
//Курск	20180731006488	 19 247,02 
//Калининград	20180731004111	 236 941,34 
//Рязань	20180731004084	 16 443,71
//Оренбург	20180731003006	 9 112,73   
//Кемерово	20180731003706	 82 585,28 
//Чебоксары	20180731003714	 439 416,67   
//Хабаровск	20180731003005	 114 723,61   
//Владивосток	20180731003000	 273 214,41 
//Пенза	20180731003872	 21 161,93");


//            СчетаЯндекс.Run(new DateTime(2018, 6, 1), @"
//Уфа	20180630019509	 381 846,26  
//Омск	20180630019501	 359 159,96 
//Челябинск	20180630019536	 743 645,46 
//Самара	20180630019494	 635 176,65  
//Москва	20180630018772	 16 908 513,23 
//Нижний Новгород	20180630019490	 294 906,71 
//Ростов-на-Дону	20180630019440	 1 131 081,51 
//Сочи	20180630019287	 337 761,40 
//Пермь	20180630019319	 1 768 796,09 
//Екатеринбург	20180630019431	 2 300 613,37 
//Казань	20180630019328	 1 981 638,90  
//Санкт-Петербург	20180630019291	 1 647 776,28 
//Волгоград	20180630019487	 45 495,47  
//Новосибирск	20180630020012	 840 852,95 
//Тюмень	20180630019566	 1 418 970,59 
//Краснодар	20180630019449	 2 040 769,08 
//Саратов	20180630020179	 488 301,36 
//Ижевск	20180630020177	 192 072,85 
//Новокузнецк	20180630020341	 30 042,03  
//Киров	20180630020160	 69 651,98 
//Красноярск	20180630020186	 117 148,12  
//Воронеж	20180630019495	195 029,03
//Ярославль	20180630020151	 10 874,21 
//Ставрополь	20180630021311	 196 047,90 
//Набережные Челны	20180630020617	 200 028,62 
//Курск	20180630022542	 49 233,49 
//Калининград	20180630020558	 190 267,32 
//Рязань	20180630020543	 8 041,46  
//Тольятти	20180630019489	 724,48   
//Оренбург	20180630019479	 7 651,56 
//Кемерово	20180630020185	 96 812,19 
//Чебоксары	20180630020183	 606 738,53 
//Хабаровск	20180630019476	 202 563,96 
//Владивосток	20180630019484	 175 472,23  
//Пенза	20180630020336	 16 005,46");

//            СчетаЯндекс.Run(new DateTime(2018, 5, 1), @"
//Уфа	20180531015622	 449 113,43 
//Омск	20180531015595	 348 804,26  
//Челябинск	20180531015636	 1 173 977,40  
//Самара	20180531015603	 896 847,50 
//Москва	20180531014861	 17 212 639,83  
//Нижний Новгород	20180531015593	 385 761,58  
//Ростов-на-Дону	20180531015569	 798 557,78 
//Сочи	20180531015395	 380 411,06 
//Пермь	20180531015432	 1 955 360,29 
//Екатеринбург	20180531015554	 1 995 745,71 
//Казань	20180531015427	 2 004 008,49  
//Санкт-Петербург	20180531015399	 1 454 549,39 
//Волгоград	20180531015590	 51 746,76
//Новосибирск	20180531016110	 886 902,08 
//Тюмень	20180531015642	 1 351 632,69 
//Краснодар	20180531015575	 1 611 443,35 
//Саратов	20180531017193	 399 497,44 
//Ижевск	20180531016304	 82 991,27 
//Новокузнецк	20180531016458	 32 227,11 
//Киров	20180531016284	 82 850,59 
//Красноярск	20180531016782	 134 249,02
//Воронеж	20180531015600	 205 479,36 
//Ярославль	20180531016275	 17 309,20 
//Ставрополь	20180531017416	 230 315,08 
//Набережные Челны	20180531016737	 238 547,19 
//Курск	20180531018695	 106 303,37  
//Калининград	20180531016676	 110 612,32 
//Рязань	20180531016657	 136 841,35
//Оренбург	20180531015602	 9 586,31 
//Кемерово	20180531016300	 121 751,72  
//Чебоксары	20180531016307	 671 037,72 
//Хабаровск	20180531015583	 171 300,53  
//Владивосток	20180531015589	 103 017,86  
//Пенза	20180531016451	 127 279,22 
//");

//            СчетаЯндекс.Run(new DateTime(2018, 4, 1), @"
//Уфа	20180430012480	 646 334,86 
//Омск	20180430012472	 452 358,33 
//Челябинск	20180430012500	 1 448 250,83 
//Самара	20180430012474	 906 800,78 
//Москва	20180430011717	 20 150 143,32 
//Нижний Новгород	20180430012467	 451 960,11 
//Ростов-на-Дону	20180430012422	 716 969,64 
//Сочи	20180430012255	 450 970,61 
//Пермь	20180430012291	 2 264 338,22 
//Екатеринбург	20180430012416	 2 142 523,19 
//Казань	20180430012283	 2 142 362,54 
//Санкт-Петербург	20180430012264	1 348 661,38
//Волгоград	20180430012460	 57 770,73
//Новосибирск	20180430012998	 820 229,27 
//Тюмень	20180430012509	 1 471 830,27  
//Краснодар	20180430012431	 1 289 594,82 
//Саратов	20180430013206	 350 601,03 
//Ижевск	20180430013204	 122 363,15  
//Новокузнецк	20180430013363	 30 868,90 
//Киров	20180430013172	 33 977,86 
//Красноярск	20180430013199	 114 445,23 
//Воронеж	20180430012470	 214 667,97 
//Ярославль	20180430013180	 6 177,26 
//Ставрополь	20180430014357	 172 286,48 
//Набережные Челны	20180430013653	 91 028,19 
//Курск	20180430015627	 60 603,92  
//Калининград	20180430013599	 67 374,69 
//Рязань	20180430013577	 99 451,13
//Оренбург	20180430012466	 15 015,31 
//Кемерово	20180430013197	 65 231,92 
//Чебоксары	20180430013218	 722 914,33 
//Хабаровск	20180430012457	 153 354,57 
//Владивосток	20180430012454	 48 116,78  
//Пенза	20180430013359	 189 133,71 
//");

//            СчетаЯндекс.Run(new DateTime(2018, 3, 1), @" 
//Уфа	20180331010010	 689 025,57 
//Омск	20180331009999	 654 131,21 
//Челябинск	20180331010022	 1 439 859,01 
//Самара	20180331009996	 904 002,05 
//Москва	20180331009202	 22 387 951,60 
//Нижний Новгород	20180331009986	 415 105,11 
//Ростов-на-Дону	20180331009949	 917 886,06 
//Сочи	20180331009777	 421 660,48 
//Пермь	20180331009795	 1 985 219,80 
//Екатеринбург	20180331009933	 2 757 486,06 
//Казань	20180331009790	 2 288 584,08 
//Санкт-Петербург	20180331009794	 1 475 211,33 
//Волгоград	20180331009983	 48 030,29 
//Новосибирск	20180331010532	 985 302,97 
//Тюмень	20180331010026	 1 917 849,51 
//Краснодар	20180331009952	 1 800 595,83 
//Саратов	20180331010735	 392 192,21 
//Ижевск	20180331010736	 147 471,45  
//Новокузнецк	20180331010907	 33 023,64 
//Киров	20180331010705	 62 242,88 
//Красноярск	20180331010738	 134 634,23 
//Воронеж	20180331009993	 212 096,27 
//Ярославль	20180331010699	 12 640,86 
//Ставрополь	20180331011891	 122 580,99 
//Набережные Челны	20180331011189	 90 299,15 
//Курск	20180331013232	 66 295,86 
//Калининград	20180331011138	 17 989,43 
//Рязань	20180331011117 	 64 195,97 
//Тольятти	20180331009995	 302,12   
//Оренбург	20180331009988	 15 252,68 
//Кемерово	20180331010740	 74 657,46 
//Чебоксары	20180331010729	 820 854,39 
//Хабаровск	20180331009975	 150 587,28  
//Владивосток	20180331009979	 51 040,38 
//Пенза	20180331010899	 188 914,80 
//");

//            СчетаЯндекс.Run(new DateTime(2018, 2, 1), @" 
//Уфа	20180228008008	551454,63
//Омск	20180228007998	439557,77
//Челябинск	20180228008017	1064268,48
//Самара	20180228007996	712913,13
//Москва	20180228007170	20249322,18
//Нижний Новгород	20180228007983	337160,19
//Ростов-на-Дону	20180228007944	770875,28
//Сочи	20180228007760	404681,42
//Пермь	20180228007788	1215342,92
//Екатеринбург	20180228007924	2235444,63
//Казань	20180228007782	1894307,51
//Санкт-Петербург	20180228007773	1516408,18
//Волгоград	20180228007985	34786,59
//Новосибирск	20180228008541	909011,54
//Тюмень	20180228008003	1817140,68
//Краснодар	20180228007941	1661873,83
//Саратов	20180228009076	374998,38
//Ижевск	20180228008779	248681,39
//Новокузнецк	20180228008948	35394,88
//Киров	20180228008740	105150,99
//Красноярск	20180228008769	166819,95
//Воронеж	20180228007989	163928,18
//Ярославль	20180228008738	15133,07
//Ставрополь	20180228009960	84840,13
//Набережные Челны	20180228009249	95387,86
//Курск	20180228011334	131261,01
//Калининград	20180228009181	6503,64
//Рязань	20180228009171	31503,66
//Тольятти	20180228007987	1312,69
//Оренбург	20180228007993	19918,03
//Кемерово	20180228008771	213228,63
//Чебоксары	20180228008778	807111,86
//Хабаровск	20180228007973	122237,98
//Владивосток	20180228007988	59121,92
//Пенза	20180228008943	140296,77 
//");

//            СчетаЯндекс.Run(new DateTime(2018, 1, 1), @"
//Уфа	20180131006460	 777 897,67 
//Омск	20180131006439	409153,20
//Челябинск	20180131006457	 965 083,56   
//Самара	20180131006440	 744 560,82   
//Москва	20180131005597	 19 765 220,04   
//Нижний Новгород	20180131006436	 337 993,04   
//Ростов-на-Дону	20180131006391	 845 826,27   
//Сочи	20180131006209	 612 704,23   
//Пермь	20180131006219	 960 993,34   
//Екатеринбург	20180131006358	 2 116 002,86   
//Казань	20180131006214	 2 184 596,34   
//Санкт-Петербург	20180131006204	 1 446 049,57   
//Волгоград	20180131006438	 27 991,15   
//Новосибирск	20180131007010	 1 270 490,75   
//Тюмень	20180131006431	 2 520 963,79   
//Краснодар	20180131006394	 1 449 825,42   
//Саратов	20180131007247	 435 886,06   
//Ижевск	20180131007248	 213 707,39   
//Новокузнецк	20180131007431	 42 175,55   
//Киров	20180131007210	 111 962,72   
//Красноярск	20180131007246	 293 351,47   
//Воронеж	20180131006450	 156 112,98   
//Ярославль	20180131007205	 12 224,44   
//Ставрополь	20180131008433	 131 006,95   
//Набережные Челны	20180131007725	 132 857,71   
//Курск	20180131009855	86015,33
//Калининград	20180131007665	9500,19
//Рязань	20180131007647	 7 918,51   
//Тольятти	20180131006448	 19 601,49   
//Оренбург	20180131006453	 22 845,68   
//Кемерово	20180131007245 	 267 763,34   
//Чебоксары	20180131007235	 927 693,02   
//Хабаровск	20180131006441	 77 211,70   
//Владивосток	20180131006446	 58 548,22   
//Пенза	20180131007428	 73 534,80   
//");

//            СчетаЯндекс.Run(new DateTime(2017, 12, 1), @"
//Уфа	20171231005717	 879 397,03   
//Омск	20171231005694	 605 559,06   
//Челябинск	20171231005718	 1 163 674,05   
//Самара	20171231005702	 1 237 237,24   
//Москва	20171231004836	 24 599 765,94   
//Нижний Новгород	20171231005684	 365 585,17   
//Ростов-на-Дону	20171231005651	 961 480,33   
//Сочи	20171231005473	 498 483,11   
//Пермь	20171231005489	 1 165 572,29   
//Екатеринбург	20171231005621	 2 420 583,73   
//Казань	20171231005479	 2 301 774,56   
//Санкт-Петербург	20171231005486	 2 094 200,32   
//Волгоград	20171231005704	 32 048,88   
//Новосибирск	20171231006301	 1 357 559,35   
//Тюмень	20171231005708	 2 611 025,30   
//Краснодар	20171231005645	 1 193 497,56   
//Саратов	20171231006515	 428 145,52   
//Ижевск	20171231006544	 253 670,72   
//Новокузнецк	20171231006716	 50 236,94   
//Киров	20171231006485	 120 424,13   
//Красноярск	20171231006534	 424 707,82   
//Воронеж	20171231005697	 215 273,86   
//Ярославль	20171231006488	 13 289,89   
//Ставрополь	20171231007780	 149 218,84   
//Набережные Челны	20171231007030	 169 047,36   
//Курск	20171231009249	 94 062,55   
//Калининград	20171231006969	 22 385,82   
//Рязань	20171231006941	 24 049,82   
//Тольятти	20171231005706	 9 477,27   
//Оренбург	20171231005713	 19 190,71   
//Кемерово	20171231006529	 267 854,25   
//Чебоксары	20171231006520	 1 151 472,25   
//Хабаровск	20171231005692	 138 003,79   
//Владивосток	20171231005698	 50 333,19   
//Пенза	20171231006710	 35 766,25   
//            ");

//            СчетаЯндекс.Run(new DateTime(2017, 11, 1), @"
//Уфа	20171130004807	 567 204,68 
//Омск	20171130004785	 810 405,97 
//Челябинск	20171130004809	 1 034 679,81  
//Самара	20171130004790	 785 681,04 
//Москва	20171130003914	20 666 793,20
//Нижний Новгород	20171130004781	 332 144,72 
//Ростов-на-Дону	20171130004731	 596 546,77 
//Сочи	20171130004555	 236 865,52 
//Пермь	20171130004569	 874 918,98 
//Екатеринбург	20171130004703	 2 106 070,64 
//Казань	20171130004556	 1 683 672,50 
//Санкт-Петербург	20171130004544	 1 668 796,25 
//Волгоград	20171130004793	 37 376,46 
//Новосибирск	20171130005381	 1 115 971,47 
//Тюмень	20171130004788	 2 195 546,17 
//Краснодар	20171130004737	 1 023 328,48 
//Саратов	20171130005633	251 844,51
//Ижевск	20171130005628	 215 060,45 
//Новокузнецк	20171130005833	 41 287,36 
//Киров	20171130005590	 122 367,08 
//Красноярск	20171130005631	 386 015,93 
//Воронеж	20171130004798	 170 368,61 
//Ярославль	20171130005594	 51 387,64 
//Ставрополь	20171130006876	 98 683,98 
//Набережные Челны	20171130006137	 169 702,60 
//Курск	20171130008355	 121 924,62  
//Калининград	20171130006078	 21 800,31 
//Рязань	20171130006048	 75 691,68 
//Тольятти	20171130004796	 3 064,03 
//Оренбург	20171130004801	 18 278,37 
//Кемерово	20171130005625	 267 377,82 
//Чебоксары	20171130005629	 1 167 614,11 
//Хабаровск	20171130004782	 97 184,39 
//Владивосток	20171130004792	 26 041,22 
//Пенза	20171130005824	 14 234,91 
//");

//            СчетаЯндекс.Run(new DateTime(2017, 10, 1), @"
//Уфа	20171031004179	 362 342,14 
//Омск	20171031004157	 834 747,66 
//Челябинск	20171031004185	 1 006 597,68 
//Самара	20171031004158	 583 706,65 
//Москва	20171031003251	 25 539 621,16 
//Нижний Новгород	20171031004174	 344 661,82 
//Ростов-на-Дону	20171031004102	 677 445,63 
//Сочи	20171031003954	182 421,72
//Пермь	20171031003940	973 173,21
//Екатеринбург	20171031004083	 2 135 663,78 
//Казань	20171031003930	 2 214 970,59 
//Санкт-Петербург	20171031003947	 1 923 159,71 
//Волгоград	20171031004164	 41 591,76 
//Новосибирск	20171031004779	 1 161 533,73 
//Тюмень	20171031004163	 1 969 177,78 
//Краснодар	20171031004105	 1 332 031,32 
//Саратов	20171031005032	 181 970,97 
//Ижевск	20171031005040	 194 560,15 
//Новокузнецк	20171031005237	30 436,07
//Киров	20171031005002	111 434,28
//Красноярск	20171031005036	 306 233,14 
//Воронеж	20171031004192	178 267,39
//Ярославль	20171031004995	 55 503,61 
//Ставрополь	20171031006386	165 378,87
//Набережные Челны	20171031005600	 210 107,39 
//Курск	20171031007891	65 887,61
//Калининград	20171031005524	37 203,70
//Рязань	20171031005458	 85 376,42 
//Тольятти	20171031004199	 3 026,08 
//Оренбург	20171031004172	 11 301,98 
//Кемерово	20171031005079	 199 277,78 
//Чебоксары	20171031005034	 1 133 831,14 
//Хабаровск	20171031004152	51 496,06
//Владивосток	20171031004170	 20 586,95 
//Пенза	20171031005226	 10 106,70");

//            СчетаЯндекс.Run(new DateTime(2017, 9, 1), @"
//Уфа	20170930003708	269210,18
//Омск	20170930003691	 869 379,59   
//Челябинск	20170930003716	 886 551,08   
//Самара	20170930003678	 525 264,65   
//Москва	20170930002743	 27 655 871,45   
//Нижний Новгород	20170930003677	 449 826,63   
//Ростов-на-Дону	20170930003631	670111,68
//Сочи	20170930003443	 154 813,65   
//Пермь	20170930003448	 1 028 437,10   
//Екатеринбург	20170930003619	 1 936 426,40   
//Казань	20170930003445	 2 048 431,58   
//Санкт-Петербург	20170930003436	 1 974 529,13   
//Волгоград	20170930003687	 45 040,94   
//Новосибирск	20170930004276	 1 304 078,88   
//Тюмень	20170930003703	 2 404 182,82   
//Краснодар	20170930003635	1060965,52
//Саратов	20170930004588	 124 665,54   
//Ижевск	20170930004594	 170 313,26   
//Новокузнецк	20170930004791	 26 102,93   
//Киров	20170930004557	 110 334,38   
//Красноярск	20170930004574	 239 250,31   
//Воронеж	20170930003696	 129 445,31   
//Ярославль	20170930004538	 59 626,61   
//Ставрополь	20170930005922	 177 749,63   
//Набережные Челны	20170930005111	 194 237,83   
//Курск	20170930007418	 27 808,99   
//Калининград	20170930005054	 41 404,61   
//Рязань	20170930005032	 73 251,88   
//Тольятти	20170930003693	 4 709,82   
//Оренбург	20170930003698	8718,23
//Кемерово	20170930004576	170177,36
//Чебоксары	20170930004579	 793 423,62   
//Хабаровск	20170930003685	 49 068,73   
//Владивосток	20170930003680	 31 769,57   
//Пенза	20170930004784	19131,81");

//            СчетаЯндекс.Run(new DateTime(2017, 8, 1), @"
//Уфа	20170831000471	352744,91
//Омск	20170831000457	1021174,52
//Челябинск	20170831000484	620641,75
//Самара	20170831000461	598521,43
//Москва	20170831010406	25704527,75
//Нижний Новгород	20170831000464	428503,72
//Ростов-на-Дону	20170831000422	601155,99
//Сочи	20170831000195	143662,67
//Пермь	20170831000223	1247874,55
//Екатеринбург	20170831000534	2345871,43
//Казань	20170831000233	1520412,66
//Санкт-Петербург	20170831000230	2392866,42
//Волгоград	20170831000442	48317,74
//Новосибирск	20170831001128	1615197,51
//Тюмень	20170831000475	1967852,34
//Краснодар	20170831000412	1205561,81
//Саратов	20170831001364	116820,75
//Ижевск	20170831001380	276266,30
//Новокузнецк	20170831001587	27076,56
//Киров	20170831001347	79426,00
//Красноярск	20170831001363	158304,66
//Воронеж	20170831000462	98690,55
//Ярославль	20170831001328	178840,42
//Ставрополь	20170831002759	199514,55
//Набережные Челны	20170831001923	315615,58
//Курск	20170831004327	562,14
//Калининград	20170831001852	36103,18
//Рязань	20170831001815	55384,12
//Тольятти	20170831000452	2654,03
//Оренбург	20170831000455	6672,00
//Кемерово	20170831001372	222317,24
//Чебоксары	20170831001371	493274,02
//Хабаровск	20170831000438	32997,78
//Владивосток	20170831000444	24009,75
//Пенза	20170831001575	31442,88
//            ");

//            СчетаЯндекс.Run(new DateTime(2017, 7, 1), @"
//Уфа	20170731002672	256 908,14
//Омск	20170731009496	 1 353 175,57 
//Челябинск	20170731009497	429 257,91
//Самара	20170731002670	 582 756,26 
//Москва	20170731000557	 30 444 328,01 
//Нижний Новгород	20170731002675	529 590,06
//Ростов-на-Дону	20170731002599	 360 650,36 
//Сочи	20170731002372	 81 770,85 
//Пермь	20170731002393	 1 461 364,88 
//Екатеринбург	20170731002560	 2 865 875,90 
//Казань	20170731002378	 1 369 774,81 
//Санкт-Петербург	20170731002374	2 216 398,68
//Волгоград	20170731002682	 60 923,21 
//Новосибирск	20170731003386	 1 500 283,68 
//Тюмень	20170731009500	 1 924 845,17 
//Краснодар	20170731002602	 895 838,98 
//Саратов	20170731003571	 78 611,89 
//Ижевск	20170731003580	 225 153,66 
//Новокузнецк	20170731003789	 16 965,63 
//Киров	20170731003551	 83 091,81 
//Красноярск	20170731003562	 117 790,61 
//Воронеж	20170731002665	 145 702,44 
//Ярославль	20170731003547	 142 351,11 
//Ставрополь	20170731004970	 297 590,34 
//Набережные Челны	20170731004121	 357 851,36 
//Курск	20170731006541	 231,45   
//Калининград	20170731004048	 29 378,30 
//Рязань	20170731004035	 32 187,54 
//Тольятти	20170731002661	 1 017,72 
//Оренбург	20170731002664	 5 691,79 
//Кемерово	20170731003568	 197 545,15 
//Чебоксары	20170731003576	 368 159,78 
//Хабаровск	20170731002656	 30 026,50 
//Владивосток	20170731002653	 22 674,00 
//Пенза	20170731003777	 20 605,28");

//            СчетаЯндекс.Run(new DateTime(2017, 6, 1), @"
//Уфа	20170630002345	171 703,83 
//Омск	20170630002343	1 185 180,47
//Челябинск	20170630002385	501 228,19 
//Самара	20170630002339	517 143,13 
//Москва	20170630000625	30 329 838,71 
//Нижний Новгород	20170630002334	456 157,81 
//Ростов-на-Дону	20170630002271	728 710,06 
//Сочи	20170630002049	19 161,12 
//Пермь	20170630002085	1 615 335,36 
//Екатеринбург	20170630002298	2 803 653,55 
//Казань	20170630002069	1 485 721,05 
//Санкт-Петербург	20170630002063	1 907 747,87 
//Волгоград	20170630002325	72 258,53 
//Новосибирск	20170630003047	 1 265 483,71
//Тюмень	20170630002371	 1 933 952,88 
//Краснодар	20170630002263	 585 553,02
//Саратов	20170630003268	41 238,83
//Ижевск	20170630003283	 151 572,39
//Новокузнецк	20170630003499	 18 793,43 
//Киров	20170630003285	 58 052,89 
//Красноярск	20170630003282	72 656,43
//Воронеж	20170630002327	 136 993,61 
//Ярославль	20170630003232	 123 881,11 
//Ставрополь	20170630004756	 192 788,84
//Набережные Челны	20170630003846	 323 814,94 
//Курск	20170630006346	 550,15
//Калининград	20170630003775	 3 065,86
//Рязань	20170630003745 	 18 385,31
//Тольятти	20170630002328	 11 861,37 
//Оренбург	20170630002321	 5 262,83
//Кемерово	20170630003269	 85 753,55
//Чебоксары	20170630003314	 274 041,73 
//Хабаровск	20170630002313	 30 694,74 
//Владивосток	20170630002319	 15 808,66
//Пенза	20170630003490	 7 158,59
//");

//            СчетаЯндекс.Run(new DateTime(2017, 5, 1), @"
//Уфа	20170531001935	94 624,45
//Омск	20170531001917	1 043 262,48
//Челябинск	20170531001942	500 166,48
//Самара	20170531001912	487 050,28
//Москва	20170531000822	35 932 995,67
//Нижний Новгород	20170531001909	448 573,27
//Ростов-на-Дону	20170531001860	441 308,42
//Сочи	20170531001625	20 254,16
//Пермь	20170531001653	1 587 944,28
//Екатеринбург	20170531001858	2 501 757,20
//Казань	20170531001637	1 436 346,01
//Санкт-Петербург	20170531001634 	1 980 597,68
//Волгоград	20170531001915 	29 526,52
//Новосибирск	20170531002671	1 145 907,81
//Тюмень	20170531001929	1 693 283,92
//Краснодар	20170531001859	446 790,18
//Саратов	20170531002891	33 798,22
//Ижевск	20170531002890	129 668,49
//Новокузнецк	20170531003108	16 534,73
//Киров	20170531002856	133 889,30
//Красноярск	20170531002889	38 273,74
//Воронеж	20170531001921 	79 361,92
//Ярославль	20170531002846	144 930,39
//Ставрополь	20170531004379	91 560,08
//Набережные Челны	20170531003467	327 655,46
//Курск	20170531006016 	1 602,59
//Калининград	20170531003401	6 230,06
//Рязань	20170531003379	7 075,99
//Тольятти	20170531001919	32 117,55
//Оренбург	20170531001924 	7 548,38
//Кемерово	20170531002894	53 367,01
//Чебоксары	20170531002886	250 880,82
//Хабаровск	20170531001899	14 532,32
//Владивосток	20170531001914	13 011,48
//");


//            СчетаЯндекс.Run(new DateTime(2017, 4, 1), @"
//Уфа	20170430001609	 35 308,15   
//Омск	20170430001584	 1 222 073,15   
//Челябинск	20170430001604	 581 365,27   
//Самара	20170430001589	 420 586,84   
//Москва	20170430000467	 45 216 390,12   
//Нижний Новгород	20170430001559	 614 883,56   
//Ростов-на-Дону	20170430001459	 369 388,46   
//Сочи	20170430001309	 10 260,58   
//Пермь	20170430001303	 1 265 187,09   
//Екатеринбург	20170430001577	 2 602 011,80   
//Казань	20170430001287	 1 482 164,04   
//Санкт-Петербург	20170430001398	 2 100 039,90   
//Волгоград	20170430001566	 34 821,15   
//Новосибирск	20170430002234	 1 133 802,42   
//Тюмень	20170430001623	 1 598 098,33   
//Краснодар	20170430001464	 303 727,17   
//Саратов	20170430002556	 29 858,72   
//Ижевск	20170430002557	 106 177,71   
//Новокузнецк	20170430002849	 20 806,15   
//Киров	20170430002513	 159 174,24   
//Красноярск	20170430002562	 42 145,08   
//Воронеж	20170430001605	 89 859,44   
//Ярославль	20170430002511	 129 000,98   
//Ставрополь	20170430004094	 80 466,44   
//Набережные Челны	20170430003241	 220 730,94   
//Курск	20170430005808	 216,00   
//Калининград	20170430003076	 4 391,08   
//Рязань	20170430003042	 240,96   
//Тольятти	20170430001599	 5 126,51   
//Оренбург	20170430001598	 11 744,73   
//Кемерово	20170430002554	 5 556,27   
//Чебоксары	20170430002533	 194 621,31   
//Хабаровск	20170430001563	 11 420,07   
//Владивосток	20170430001558	 11 431,81");

//            СчетаЯндекс.Run(new DateTime(2017, 3, 1), @"
//                Уфа	20170331000525	1 972,81 
//                Омск	20170331000528	885 510,16 
//                Челябинск	20170331000645	608 587,73 
//                Самара	20170331000514	260 516,46 
//                Москва	20170331005014	41 586 056,95 
//                Нижний Новгород	20170331000548	1 243 031,52 
//                Ростов-на-Дону	20170331000448	247 185,00 
//                Сочи	20170331000231	13 175,29 
//                Пермь	20170331000243	1 317 524,07 
//                Екатеринбург	20170331000765	2 428 138,16 
//                Казань	20170331000234	1 252 564,84 
//                Санкт-Петербург	20170331000227	1 744 161,77 
//                Волгоград	20170331000515	51 998,36 
//                Новосибирск	20170331001357	1 423 011,34 
//                Тюмень	20170331000539	1 684 679,55 
//                Краснодар	20170331000445	87 332,74 
//                Саратов	20170331001534	28 072,54 
//                Ижевск	20170331001549	82 524,19 
//                Новокузнецк	20170331001766	27 016,61 
//                Киров	20170331001517	178 189,18 
//                Красноярск	20170331001541	56 128,78 
//                Воронеж	20170331000510	101 872,57 
//                Ярославль	20170331001512	128 885,17 
//                Ставрополь	20170331003070	109 216,90 
//                Чебоксары	20170331001557	278 056,19 
//                Набережные Челны	20170331002136	177 223,49 
//                Хабаровск	20170331000494	9 383,58 
//                Оренбург	20170331000512	15 157,72 
//                Тольяти	20170331000507	845,07 
//                Владивосток	20170331000506	886,37 
//                Курск	20170331004621	6,45 
//                Калининград	20170331002053	2 268,09");

//            СчетаЯндекс.Run(new DateTime(2017, 2, 1), @"
//            Уфа	20170228001172	270,93 
//            Омск	20170228001171	345 539,14 
//            Челябинск	20170228001178	372 971,59 
//            Самара	20170228001146	87 978,82 
//            Москва	20170228002473	42 946 089,77 
//            Нижний Новгород	20170228001143	467 811,80 
//            Ростов-на-Дону	20170228001097	97 649,68 
//            Сочи	20170228000856	17 635,31 
//            Пермь	20170228000913	803 130,01 
//            Екатеринбург	20170228001245	1 855 710,72 
//            Казань	20170228000884	757 224,95 
//            Санкт-Петербург	20170228000881	1 193 372,54 
//            Волгоград	20170228001151	21 497,51 
//            Новосибирск	20170228001872	969 318,44 
//            Тюмень	20170228001257	1 092 780,59 
//            Краснодар	20170228001083	53 079,12 
//            Саратов	20170228002191	13 529,83 
//            Ижевск	20170228002192	47 822,82 
//            Новокузнецк	20170228002426	19 530,08 
//            Киров	20170228002151	110 769,02 
//            Красноярск	20170228002197	30 719,02 
//            Воронеж	20170228001144	52 388,80 
//            Ярославль	20170228002173	155 533,27 
//            Ставрополь	20170228003738	138 907,00 
//            Чебоксары	20170228002208	182 043,64 
//            Набережные Челны	20170228002799	21 557,25 
//            Хабаровск	20170228001147	10 367,64 
//            Оренбург	20170228001156	2 006,25 
//            Тольятти	20170228001155	392,50    
//            ");

//            СчетаЯндекс.Run(new DateTime(2017, 1, 1), @"
//Уфа	20170131001035	 1 437,42   
//Омск	20170131001007	 76 576,65   
//Челябинск	20170131001081	 243 300,04   
//Самара	20170131001017	 38 671,71   
//Москва	20170131001024	 50 565 738,46   
//Нижний Новгород	20170131001028	 181 863,57   
//Ростов-на-Дону	20170131000954	 157 917,08   
//Сочи	20170131000716	 13 970,15   
//Пермь	20170131000733	 757 512,98   
//Екатеринбург	20170131000953	 1 512 764,80   
//Казань	20170131000709	 594 112,19   
//Санкт-Петербург	20170131000738	 1 110 890,82   
//Волгоград	20170131001014	 14 928,59   
//Новосибирск	20170131001765	 781 560,79   
//Тюмень	20170131001093	 815 743,16   
//Краснодар	20170131000947	 41 432,75   
//Саратов	20170131002074	 18 780,71   
//Ижевск	20170131002065	 32 750,28   
//Новокузнецк	20170131002308	 6 527,02   
//Киров	20170131002018	 24 513,45   
//Красноярск	20170131002077	 10 410,50   
//Воронеж	20170131001021	 43 624,98   
//Ярославль	20170131002020	 69 473,62   
//Ставрополь	20170131003612	 55 110,43   
//Чебоксары	20170131002051	 56 379,42   
//Набережные Челны	20170131002663	 10 144,54   
//Хабаровск	20170131001005	 6 163,71    
//");

//            СчетаЯндекс.Run(new DateTime(2016, 12, 1), @"
//Уфа	20161231000943	 2 325,15   
//Омск	20161231000913	 50 934,00   
//Челябинск	20161231000942	 141 662,41   
//Самара	20161231000907	 40 194,88   
//Москва	20161231002157	 59 419 228,56   
//Нижний Новгород	20161231000919	 28 914,95   
//Ростов-на-Дону	20161231000852	 147 591,49   
//Сочи	20161231000612	 5 857,41   
//Пермь	20161231000668	 683 415,79   
//Екатеринбург	20161231000846	 1 614 823,18   
//Казань	20161231000606	 263 858,34   
//Санкт-Петербург	20161231000659	 1 012 612,89   
//Волгоград	20161231000952	 55 507,82
//Новосибирск	20161231001707	 508 489,26   
//Тюмень	20161231000917	 696 838,52   
//Краснодар	20161231000855	 33 801,66   
//Саратов	20161231001993	5 573,63
//Ижевск	20161231002008	 23 264,08   
//Новокузнецк	20161231002244	 5 321,78   
//Киров	20161231001951	 3 191,21   
//Красноярск	20161231002000	 10 800,55
//Воронеж	20161231000921	 50 759,59   
//Ярославль	20161231001947	 54 259,35
//Ставрополь	20161231003514 	 6 423,07   
//Чебоксары	20161231001986 	 19 451,65   
//Набережные Челны	20161231002622	 8 440,02   
//");

            //var statistics = new Dictionary<DateTime, double>()
            //{
            //    { new DateTime(2013, 7, 1), 37533 },
            //    { new DateTime(2013, 8, 1), 483673 },
            //    { new DateTime(2013, 9, 1), 876189 },
            //    { new DateTime(2013, 10, 1), 1199735 },
            //    { new DateTime(2013, 11, 1), 1887327 },
            //    { new DateTime(2013, 12, 1), 3201812 },

            //    { new DateTime(2014, 1, 1), 2644778 },
            //    { new DateTime(2014, 2, 1), 2948116 },
            //    { new DateTime(2014, 3, 1), 3467979 },
            //    { new DateTime(2014, 4, 1), 3454066 },
            //    { new DateTime(2014, 5, 1), 2762795 },
            //    { new DateTime(2014, 6, 1), 2680338 },
            //    { new DateTime(2014, 7, 1), 2727636 },
            //    { new DateTime(2014, 8, 1), 2657242 },
            //    { new DateTime(2014, 9, 1), 2922845 },
            //    { new DateTime(2014, 10, 1), 2766180 },
            //    { new DateTime(2014, 11, 1), 0 },
            //    { new DateTime(2014, 12, 1), 0 },

            //    { new DateTime(2015, 1, 1), 4417312 },
            //    { new DateTime(2015, 2, 1), 4102192 },
            //    { new DateTime(2015, 3, 1), 4422437 },
            //    { new DateTime(2015, 4, 1), 4501485 },
            //    { new DateTime(2015, 5, 1), 4555988 },
            //    { new DateTime(2015, 6, 1), 4941303 },
            //    { new DateTime(2015, 7, 1), 5518778 },
            //    { new DateTime(2015, 8, 1), 6280656 },
            //    { new DateTime(2015, 9, 1), 5197597 }, //6115966
            //    { new DateTime(2015, 10, 1), 1770965 }, //5134716
            //    { new DateTime(2015, 11, 1), 1057987 }, //4554237
            //    { new DateTime(2015, 12, 1), 0 } //3281138
            //};

            //foreach (var item in statistics)
            //{
            //    Console.WriteLine("{0:d} = {1:N0}", item.Key, item.Value);

            //    AggregatorHelper.Report.Set(item.Key, "090a35892a964d8b9538fe2bbf16e199", new AggregatorAct()
            //    {
            //        agg = "d1bf2d6baf30419f8addad3bb0ed1d7b",
            //        complete_commission_broker = item.Value
            //    });
            //}

            //Найти ИНН
            //var find = "131900992376";
            //foreach (var agg in AggregatorHelper.Aggegator.List())
            //{
            //    Console.WriteLine(agg.City);

            //    Parallel.For(0, 24, (i) =>
            //    {
            //        var date = (new DateTime(2015, 1, 1)).AddMonths(i);
            //        var reports = AggregatorHelper.Report.List(date, agg.Agg);
            //        if (reports == null || reports.Acts == null || reports.Acts.Count == 0)
            //            return;

            //        var item = reports.Acts.FirstOrDefault(p => string.Equals(p.Value.inn, find, StringComparison.CurrentCultureIgnoreCase));
            //        if (item.Value != null)
            //        {
            //            Console.WriteLine(item.Key);
            //        }
            //    });
            //}

            //найти все ООО
            //var clients = AggregatorHelper.Client.List();
            //var count = clients.Where(p => p.Company != null && p.Enable && string.Equals(p.Company.OrgType, "ООО", StringComparison.CurrentCultureIgnoreCase)).Count();
            //if (count > 0)
            //{
            //}

            //посчитать разницу счетов Яндекс и фактической комиссии
            //var bill = 0d;
            //var act = 0d;
            //var aggs = AggregatorHelper.Aggegator.List().OrderBy(p => p.City).ToArray();

            //for (var i = new DateTime(2017, 1, 1); i < new DateTime(2018, 1, 1); i = i.AddMonths(1))
            //{


            //    foreach (var agg in aggs)
            //    {
            //        var reports = AggregatorHelper.Report.List(i, agg.Agg);
            //        if (reports == null || reports.Acts == null || reports.Acts.Count == 0)
            //            continue;

            //        var calc = reports.Acts.Sum(p => p.Value.complete_commission_yandex);
            //        if (calc == 0)
            //            continue;

            //        if (reports.Bills == null)
            //        {
            //            Console.WriteLine("{0} - {1:d}", agg.Agg, i);
            //            continue;
            //        }

            //        var calc_bill = reports.Bills.Sum(p => p.Value.sum) + reports.Acts.Sum(p => p.Value.tips_pay);

            //        if (calc < calc_bill)
            //        {
            //            bill += calc_bill;
            //            act += calc;
            //        }
            //    }
            //}

            //var balance = act - bill;
            //if (balance > 0)
            //{
            //}

            Console.WriteLine("end");
            Console.Read();
        }
    }
}
